{"doc_id": "Vincent_Letter_of_Recommendation.pdf", "page": 1, "text": "November 22, 2022\nLetter of Recommendation\nTo Whom it May Concern\nI am pleased to provide this letter of recommendation for Vincent Göke, born on March \n25, 1998, in Marburg. Vincent worked as a Product & User Experience intern at \nAlgoriddim from February 14, 2022 until April 30, 2022.\nAlgoriddim, founded in 2006, is a leading software company specializing in music and \nvideo applications. Our ﬂagship app, “djay”, has been downloaded by over 50 million \nusers worldwide and is a winner of multiple Apple Design Awards. Our diverse and \nmulti-national team consists of software engineers, musicians, support, marketing and \nsocial media experts, as well as designers.\nVincent’s key tasks included research in the ﬁeld of music technology and interaction, \nas well as the design and implementation of a prototype which allowed a user to interact \nwith and manipulate music in intuitive ways. \nAs part of the research, Vincent presented his ﬁndings to core members of our \ninternational product and engineering teams. His presentations were highly engaging, in \nﬂuid English, and he managed to break down complex topics into simple terms. His \nexpert knowledge in digital audio, as well as music performance and production, \ncombined with his understanding of product design and development, proved to be an \ninvaluable asset to the team. The slides he created still serve as a reference for a \ncomprehensible bird’s eye view of the industry. \nIn the further course of his internship, Vincent elaborated on one of the presented digital \naudio manipulation concepts using state-of-the-art product development and UX \nprinciples. He created personas of potential concept users and provided user ﬂow \ncharts to illustrate key functionalities. Based on the analysis and iterative feedback, \nVincent implemented UI prototypes for tablet devices, reporting directly to our head of \nR&D. To create the wireframes and prototypes, he used state-of-the-art design tools.\nVincent is capable of thinking outside of the box and he demonstrated the ability to \nexcel in a highly interdisciplinary, fast paced environment by combining a solid \nacademic foundation with profound domain knowledge in music. We were impressed \nwith Vincent’s multiple talents. \nalgoriddim GmbH \nKöniginstr. 33 · 80539 Munich · Germany \nTel. \n+49 89 41617796-0 \nFax \n+49 89 41617796-9 \nEmail info@algoriddim.com \nWeb www.algoriddim.com \nGeneral Manager \nKarim Morsy \nTrade Register: München HRB 169889 \nVAT ID: DE256908489"}
{"doc_id": "Vincent_Letter_of_Recommendation.pdf", "page": 2, "text": "During my collaborative work with Vincent, he has been highly diligent, professional, \nand well organized. He is a great team player and I strongly believe he will be a great \naddition to whatever team he joins in the future.\nVincent’s performance exceeded our expectations of an intern and we remain in close \ncontact with him regarding potential future projects. I can recommend Vincent without \nany hesitation for any position in design, music, and product related ﬁelds.\nPlease feel free to contact me if you need any additional information or clariﬁcation.\nSincerely, \nFederico Tessmann\nCOO\nalgoriddim GmbH\nalgoriddim GmbH \nKöniginstr. 33 · 80539 Munich · Germany \nTel. \n+49 89 41617796-0 \nFax \n+49 89 41617796-9 \nEmail info@algoriddim.com \nWeb www.algoriddim.com \nGeneral Manager \nKarim Morsy \nTrade Register: München HRB 169889 \nVAT ID: DE256908489"}
