{"doc_id": "Script.pdf", "page": 1, "text": "Script \n \nNarrator(Toby): Welcome, everyone. We are students of FH Salzburg, and we are tackling \nthe challenge of promating cashless payment and local sustainable tourism. \n \nLets go. \n \n[next slide] \n \n[Scene: Salzburg Main Train Station] \n \nTraveller 1 (Eli): Hey, how are you? Are you ready to explore the city? \n \nTraveller 2 (Anica): Hiii, I am great. Can’t wait to look around! \n \n[next slide] \n \n[At the city] \n \nTraveller 1: Btw, have you heard of this new app called GreenWallet by Mastercard? \n \nTraveller 2: No, what is it about? \n \n[next slide] \n \nNarrator: That’s a great question! Let me tell you more about it.  \n \nGreenWallet is an project that is beneficial for everybody. Mastercard, the company behind \nthe project can make a big step towards a becoming a greener company and attract new \nusers.  \nThe users collet point by paying with their mastercard which which they can for example \nplant tree's.  \nOwners of local restaurant or shops benefit from the system, because they get more \ncustomers. \nAnd for the tourism regions it is beneficial as the app more evely distributes the users and \nstears them towads less crowded areas. Its a everybody wins situation. Now please enjoy \nthe show. \n \n[next slide] \n \nTraveller 1: Doesn’t this sound exciting? Here, let me show you. \n \nTraveller 2: Oh, look! There is an event happening right now at Café Schatz, where you can \nbuy two pastries and get one for free! Should we go there? \n \nTraveller 1: That sounds delicious! Let’s go! \n \n[next slide]"}
{"doc_id": "Script.pdf", "page": 2, "text": "[Scene transition: Travellers arriving at Cafe Schatz] \n \nShop Owner: Welcome to Cafe Schatz! Are you here for our special event? \n \nTraveller 1: Yes, we are. We saw it on the app. \n \nShop Owner: Great! You can buy two pastries and get one for free; what would you like? \n \nTraveller 2: Then we will get two Topfenstrudel.  \n \n[next slide] \n[Scene transition: Travellers paying with the app at the shop] \n \nTraveller 1:Oh it was successful, and we got so many points! \n \nTraveller 2: Yeah, it was a special pop-up event, we got 4 times the amount of points than \nusual! \n \n[Shop owner gives us the Kipferls] \n \n [next slide] \n \n \nShop Owner: Oh, the money is already there! The app is a great way to attract new \ncustomers and promote sustainable initiatives; I can book an event whenever it is convenient \nfor me and see my earnings instantly. It is easy to use and has been fantastic for my small \nbakery! \n \n[Going around the city again] \n \n \n[next slide] \n \nTraveller 1: Wow, that was awesome! It's great to know that we can positively impact the \nenvironment with the points we earn from using the app, would you like to plant some trees? \n \nTraveller 2: Yes, that sounds great, let’s do that! \n \n[planting the trees] \n \n[next slide] \n \n[NARRATOR:] \n \nGreenWallet is more than just an app; it's an invitation to discover the heart of Austria, one \nsustainable step at a time."}
{"doc_id": "Script.pdf", "page": 3, "text": "All together: Thank you GreenWallet! \n \n[SCENE END]"}
