{"doc_id": "PassengerReroute_Thesis.pdf", "page": 1, "text": "LUDWIG-MAXIMILIANS-UNIVERSITÄT MÜNCHEN\nDepartment “Institut für Informatik”\nLehr- und Forschungseinheit Medieninformatik\nProf. Dr. Andreas Butz\nBachelor Thesis\nPassenger Reroute: Phone-Based Intervention In\nSelf-Driving Cars\nVincent Clemens Coelestin Göke\nVincent.Goeke@campus.lmu.de\nBearbeitungszeitraum: 18. 05. 2021 bis 05. 10. 2021\nBetreuer: Jingyi Li\nVerantw. Hochschullehrer: Prof. Dr. Andreas Butz"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 2, "text": "Abstract\nNowadays, car passengers can intervene in planned driving routes by cooperating with human\ndrivers through verbal communication or utilizing mobile navigation applications. When antici-\npating future self-driving cars, it is conceivable that passenger communication with an autonomous\ndriving system could be difﬁcult under a variety of possible real life scenarios (e.g., reroute be-\nfore crossroad). Having to give time critical commands to a driverless car with overly complex or\noverly simpliﬁed interfaces could cause stress, distrust or even misuse of a novel system. As more\nand more omnipresent smart phone applications become interoperable with newer in-car infotain-\nment systems(i.e. music selection, calls), we decided to implement a spontaneous phone-based\nintervention prototype. To support this speciﬁc in-time intervention for rear seat passengers and to\ninvestigate their trust relationship in an autonomous system, we implemented three phone-based\nuser interfaces (UI) with small, medium, and large amounts of information. In a pilot study (n=11)\nand a main user study (n=30) with two types of time restraints (Fast Thinking = FT vs. Slow\nThinking = ST), we analyzed the impact of three information levels on passengers’ cooperative\nperformance and trust in the system. For both AV scenarios (driving and parking), the inﬂuence of\ntime pressure on the cooperation between the passenger and the system and the passenger’s trust\nin the system were investigated. The main user study showed that the presented interfaces invoked\nhigher trust levels (T1) in staged rerouting by a rear seat passenger compared to the baseline trust\n(T0) measured in advance of the interaction. By presenting various navigational level interven-\ntion tasks, we tested time pressure situations using a simpliﬁed shop selection and compared three\nlevels of UI information densities for trustworthiness and usability. A picture-in-picture AR traf-\nﬁc cam was viewed as mostly positive, with a few negative experiences amongst the participants\n(situational awareness, trust towards rerouting in autonomous system, feeling of control).\nThe results of the study offer data about the trust, usability and participants’ willingness to\ninteract in staged everyday situations with time pressure as an additional factor. This rear seat\npassenger prototype is the ﬁrst step towards more realistic, comprehensive UX design concepts,\nincorporating trustworthy navigational intervention in future AVs."}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 3, "text": "Task\nPassenger-Vehicle Cooperation: Exploring Rear-Seat Intervention Approach in Automated Driv-\ning:\nBy implementing three spontaneous reroute intervention scenarios for a hand-held AV UI and\nthe associated data collection (i.e. online questionnaire, screen captures, semi-structured inter-\nview), we investigated what types of information and the amount of information a phone-based\nreroute UI should offer rear seat passengers. With the intention to free up the rear seat passen-\nger to be able to make decisions, we tested for trustworthiness of the possible AV intervention\n(e.g. decision making) during non-driving-related activities (NDRA, e.g. brought-in device usage,\nentertainment, trip related planning).\n: To ideate on rear seat co-operative driving scenarios\n: To create and implement resultant application\n: To evaluate and analyse the implemented application\nI hereby declare that I have written this thesis independently, that I have marked all quotations as\nsuch and that I have indicated all sources and aids used.\nMünchen, October 5, 2021\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ."}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 4, "text": ""}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 5, "text": "Contents\n1\nIntroduction\n1\n2\nRelated work\n2\n2.1\nCooperative Driving . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2\n2.1.1\nDriver-Based Intervention\n. . . . . . . . . . . . . . . . . . . . . . . . .\n2\n2.1.2\nPassenger-Based Intervention\n. . . . . . . . . . . . . . . . . . . . . . .\n3\n2.1.3\nDivision Of Workload\n. . . . . . . . . . . . . . . . . . . . . . . . . . .\n4\n2.2\nAutomotive UIs For Cooperation (Mounted Device And Brought-In Device) . . .\n4\n2.2.1\nBuilt-In Car Interfaces . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4\n2.2.2\nPhone-Based Car Interfaces\n. . . . . . . . . . . . . . . . . . . . . . . .\n4\n2.3\nPassenger’s Attitude (Willingness To Cooperate And Trust) . . . . . . . . . . . .\n5\n2.3.1\nCustomized UX . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5\n2.3.2\nTrust And Usability . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6\n3\nConcept And Implementation\n8\n3.1\nReroute Scenario . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n8\n3.2\nUI design . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n9\n3.3\nImplementation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n15\n3.4\nPilot Study\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n15\n4\nUser Study\n17\n4.1\nMeasurements . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n18\n4.2\nParticipants . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n18\n4.3\nApparatus . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n18\n4.4\nStudy Interaction Procedure\n. . . . . . . . . . . . . . . . . . . . . . . . . . . .\n19\n5\nResults\n20\n5.1\nPerformance . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n20\n5.2\nTrust . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n20\n5.3\nUsability . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n22\n5.4\nExperience\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n22\n5.5\nSemi-Structured Interview\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n24\n6\nDiscussion\n25\n6.1\nVarying UX Preferences For Car Infotainment Systems . . . . . . . . . . . . . .\n25\n6.2\nCar Interface Information Density\n. . . . . . . . . . . . . . . . . . . . . . . . .\n25\n7\nLimitations And Future Work\n27\n7.1\nLimitations\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n27\n7.2\nShop Suggestion Process Under Time Pressure\n. . . . . . . . . . . . . . . . . .\n27\n7.3\nCustomization . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n27\n7.4\nVoice Assistant For Rerouting\n. . . . . . . . . . . . . . . . . . . . . . . . . . .\n27\n7.5\nAudio Feedback And Notiﬁcation\n. . . . . . . . . . . . . . . . . . . . . . . . .\n28\n8\nConclusion\n29\nI"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 6, "text": "1\nINTRODUCTION\n1\nIntroduction\nCooperation between the driver and passengers has been an important part of mutually beneﬁcial\ntravel experiences since the invention of the automobile [10].\nBefore ubiquitous computer-\nsupported navigation, the co-driver used analog maps of city streets to give directions to the\ndriver. If a car passenger had a wish, e.g., a break or an intermediate stop to drink or eat, he only\nhad to make it known in conversation with the trusted driver. As the technological development of\nautonomous driving progresses, i.e. automation levels 4 and 5, an active driver should no longer\nbe needed [14]. However, as the way in which the passenger intervenes in the system’s driving\nprocess is important to maintain the passenger’s trust in the system, simple, intuitive controls\nare required [11]. This highly complex technology, which must also take into account often\nunpredictable parameters of urban trafﬁc, can in some situations make suggestions for action, (e.g.\nrestaurant suggestions near the route, or a reroute proposal when a trafﬁc disruption is detected)\nbut not always make the best decision for the passenger’s personal comfort or preference. Once\nthe role of the driver is taken over by an automated system, the communication between a\npassenger who wants to communicate their rerouting wishes and concerns to the car’s navigation\nsystem could be perceived as cumbersome or even dangerous. This barrier between man and\nmachine could evoke an uncomfortable driving experience, resulting in distrust or misuse of\nthe system. We created three different rerouting scenarios, in which the goal was to set a short,\nspontaneous stopover. Along an existing route we ﬁltered shops for three use cases and presented\nthem as shop recommendations, ﬁltered by the system in advance. The levels differed not only in\ntheir shop selection, but also in their UI information density. Level 1 had a low level of vehicle,\nstore, and route information, level 3 had high level of information, and level 2 had an average\nlevel of information available, based on the amount of information from levels 1 and 3.\nThe use cases for each level were as follows:\n1. Level: Simple Information - Use case: Ice cream\n2. Level: Medium Information - Use case: Quick snack\n3. Level: Complex Information - Use case: Coffee\nTo investigate the effect of time pressure on the cooperative performance of the rear seat passen-\nger in navigation scenarios, the 30 online-study participants were divided into two equal groups.\nThe ﬁrst group had 3 minutes to plan a stopover from a moving car (Fast Thinking - FT) and the\nsecond group had 15 minutes to do the same from the rear seat of a parked car (Slow Thinking\n- ST). Furthermore, it was investigated to what extent the information density of the respective\nlevel inﬂuenced the perceived trustworthiness of the technology. It is yet to be determined what\nthe minimum level of information density is so that the occupant can still make a well-considered\nnavigation decision, and at what point the vehicle occupant is overwhelmed by the ﬂood of in-\nformation presented. The FT group predominantly chose the shop furthest away within their 3\nminute time frame. The ST group with 15 minutes time for a decision mostly picked the closest.\nThe time for task completion and interaction steps increased with the level of information density.\nAlthough the user interface’s visual design is important, the impact of other interaction modalities\n(i.e. auditive, haptic cues) on the trust the passenger had in the autonomous driving system could\nnot be examined in more detail. Future self-driving car UIs (mobile, built-in or a combination\nof the two) will have to contain a balance of information density and thoughtful placement or\ncustomizable UI elements in order to preserve the passenger’s positive user experience (UX) and\nfreedom to make in-time navigational interventions. For this online study, a map was modiﬁed\nto offer a pre-selection of stores in order to assist the participant in making a deliberate decision\nunder time pressure.\n1"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 7, "text": "2\nRELATED WORK\n2\nRelated work\nMy work targets the highly automated level 4 and the fully automated level 5 of driving as deﬁned\nby the Society of Automotive Engineers (SAE) 1. An autonomous car passenger should be able to\nengage in non-driving-related-activities (NDRA)[11, 8]. In a conventional car driving activity, a\ndistinction is made between primary (i.e. driving), secondary (i.e. assisting driving) and tertiary in-\ncar occupations (i.e. not relevant to driving) [8, 7]. The focus of our concept lies speciﬁcally on the\narea of spontaneous rerouting, i.e. a secondary task, in which the system becomes the active driver.\nThe correlation between user experience (UX) design (e.g. a mobile navigational intervention\napplication for AV (rear seat) passengers) and the user’s level of trust in and acceptance of the\noperating driving system is important for future in-car UI development. [5, 7]\n2.1\nCooperative Driving\nIn higher levels of autonomous driving (i.e. 4 and 5), the opinion of the vehicle passenger,in some\nmoral or social situations will still be required [13]. This interaction is of great relevance to the\noverall UX. If the passenger perceives the system’s behavior as subjectively inappropriate and\nnon-transparent, the passenger’s UX can be unpleasant in more complicated intervention situa-\ntions (e.g. in urban trafﬁc scenarios) as a result [15, 11, 14]. Local residents who frequently travel\nby car are familiar with bypasses and other areas where delaying trafﬁc events often occur in the\ncourse of their daily routines. In this case, the human can decide better than the machine, as the\nhuman knows from previous experience in which areas of the city trafﬁc jams or gridlocks are to\nbe expected at any given time. Given the scenario that the navigation system of the AV cannot\nprocess trafﬁc data from a city area, it would thus lay out and offer default routes according to\narrival time. In order for passengers to be able to interact with the autonomous system according\nto their preference or, as laid out in this study, to be able to speciﬁcally inﬂuence the planning\nand execution of the route, more research is needed [11]. There is some research investigating\ncooperative interfaces for higher automation levels utilizing visual and audio cues for system sug-\ngestions. In scenarios of system requests (takeover) or recommendation (reroute), the user is able\nto accept or reject suggestions[1, 9, 10, 11]. Although many industry projections for the future\nof driving speak of full automation without human involvement, previously mentioned research\nhas showed that positive travel experiences in AV involves the user in the planning level regarding\ndecision-making and route determination.\n2.1.1\nDriver-Based Intervention\nIn automation levels lower than four, only some functionalities of driving are taken over by the\nsystem [14, 1]. This automation is possible in a controlled context or in highly predictable situ-\nations, such as highway driving on clearly structured roads (e.g., in American cities, especially\nSilicon Valley). In contrast to autonomous vehicles, the focus of the interaction between driver\nand system is on the primary task of driving. The interaction space, be it a cell phone or a built-in\nvehicle interface, aims to guarantee safe driving with rudimentary, situational automation. Keep-\ning the driver’s attention on the trafﬁc and in case of emergency, being able to communicate a\ntakeover request to the driver as quickly as possible, plays a major role[1]. This concerns both\nnon-critical spontaneous situations (NCSS) and time-critical trafﬁc events that require the driver\nto take over the steering of the vehicle[9]. Because it is still very important that the driver pays\nattention to trafﬁc ﬂow at low automation levels, it is extremely difﬁcult to integrate visually de-\nmanding secondary tasks (i.e., route planning, setting preferred AV behavior). The way a vehicle\noccupant reacts to system information depends on many factors. One goal of lower automation\n1https://www.sae.org/news/2019/01/sae-updates-j3016-automated-driving-graphic\n2"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 8, "text": "2\nRELATED WORK\n2.1\nCooperative Driving\nlevel functionalities is to promote situational awareness of the driver and thus improve the effective\ntakeover of steering in emergency scenarios (e.g. a stone on a mountain road, high-risk trafﬁc)[1].\n2.1.2\nPassenger-Based Intervention\nAs a passenger (whether in the rear seat or the front passenger seat) in an autonomous driving\nsystem, one should be informed and able to spontaneously intervene in the behavior of the system.\nEven if the current autonomous driving situation is judged to be non-critical by the driving system,\nit is still recommended to integrate human’s situational decision-making to improve passenger’s\nUX in more complex trafﬁc environments [13] (e.g., picking up a friend at a certain location,\nadding a spontaneous stopover (NCSS = non-critical spontaneous situation [11]) to the existing\nroute, avoiding certain urban areas when routing to a destination, etc.)[14, 13]. The two results of\nWang’s pilot study showed that prediction level intervention in AVs and intervention in the driving\nbehavior via gaze-based and voice assistance modalities can have a positive impact on the partic-\nipant’s user experience[14]. The reason why the spotlight is on intervening in the comprehension\nlevel of the autonomous driving system has again to do with traditional driving experience. If\na driver or passenger of an AV is required to simply undertake short-term maneuver decisions,\nwithout understanding the reason for his or her intervention, the result could again be a perceived\nloss of the psychological requirements of control and safety. This is not to say, however, that inter-\nvening in driving behavior necessarily leads to a better driving experience. In Wang’s main study,\nsome participants reported improved driving behavior after intervention, but also a certain loss of\ntrust in the autonomous system’s decision-making ability[14]. In consequence, Wang developed\na framework that describes the most relevant inﬂuencing factors of such non-critical spontaneous\npassenger interventions[13] and further reduced it into a cooperative driving interaction overview\n[14]. In our study design for the navigational UI levels, we categorized displayed features of per-\nFigure 2.1: Cooperative Driving Framework [13, 14]\nceptional, comprehensional (i.e. behaviour prediction) and trajectory information (i.e. maneuver\nindication), making use of the 2.1 framework’s guidelines.\n3"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 9, "text": "2.2\nAutomotive UIs For Cooperation (Mounted Device And Brought-In Device)\n2\nRELATED WORK\n2.1.3\nDivision Of Workload\nRümelin [10] examined cooperative performance of a human driver concentrating on the \"primary\ntask\" of driving and a front-seat passenger using an in-vehicle information system (i.e., \"secondary\ntask\") to reduce the cognitive workload of the driver. For both parties (i.e., driver and passenger),\nthis resulted in an increased sense of situational control. Handing over responsibility for secondary\ntask decision-making to passengers (e.g., rerouting to avoid a trafﬁc disruption, picking a restau-\nrant or store to plan an intermediate stop, looking up sights nearby) could form a basis for system\nacceptance and establish trust in future cooperative infotainment systems in human-driven cars\nand AVs.\n2.2\nAutomotive UIs For Cooperation (Mounted Device And Brought-In Device)\nCase [4, p. 25] presented an attention model, which divides human attention into three categories.\nPrimary attention is visual and direct (i.e., trafﬁc while driving, screen interaction). Secondary\nattention works with haptics (i.e., vibrations, tangible movement), and auditory signals (e.g., no-\ntiﬁcation sound, voice assistant). Peripheral cues are categorized as tertiary attention, including\ndistant sound or noise, light and environmental vibrations. In order to make a considerate deci-\nsion in immediate trafﬁc related situations (e.g., pedestrian crossing, school), visual environmental\nawareness is required. This competes with the user’s primary attention in the activity they would\nrather engage in on their journey. To not interfere with the freedom to engage in NDRA in AVs,\nsituative intervention suggestions should be implemented, if this is preferred by the user. In or-\nder to have a cooperative ride supported by system suggestions, mounted and brought-in devices\nshould be compatible.\nTrusted UX\nIn addition to choosing the correct interaction modality and providing perception,\ncomprehension and trajectory vehicle, trafﬁc and route information, the perceived safety of the\ndriver or passenger is most important[9]. In the presence of a trusted driver or system, a sense of\nsecurity is usually present. Just as we trust the cab driver to understand city trafﬁc and be able\nto respond to requests, the AV passenger’s perceived safety depends on the trustworthiness of the\nsystem. The system should be able to integrate the passenger’s awareness and consider travel\npreferences without leading to disuse or misuse as illustrated by Miglani[7].\n2.2.1\nBuilt-In Car Interfaces\nMany functionalities that have become standard in today’s cars have been inﬂuenced by the in-\ncreasing use of portable navigation devices. To cope with the growing number of functions where\na direct and simple one-to-one mapping of a single control instance to a speciﬁc system function\nbecame impossible, more and more vehicles were equipped with built-in interfaces to offer more\nappropriate UX. Therefore, car manufacturers have been incorporating model-speciﬁc screen in-\nterfaces to provide more functionalities in their vehicle models for several years. Combined with\nthe spread of internet access in the age of ubiquitous computing, mobile devices and in-car Internet\nhot-spots have also increased the general (perceived) need for information by vehicle users [9, 4].\nBerger [3] investigated a rear seat passenger car door interface, to dynamically display trip-related\ninformation and give descriptions of points of interest along the route.\n2.2.2\nPhone-Based Car Interfaces\nAs almost everyone has access to a smartphone in their daily lives, standardized mobile interfaces\ngenerally provide an attractive opportunity to interact with today’s cooperative technology. Walch\n[12] tested a mobile intervention approach to investigate an AV passenger intervention for com-\nmon pedestrian crosswalk situations. In this driving simulation study, an everyday trafﬁc situation\n4"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 10, "text": "2\nRELATED WORK\n2.3\nPassenger’s Attitude (Willingness To Cooperate And Trust)\nin an urban environment was chosen. Offering the possibility of cooperation between the passen-\nger and the autonomous driving system at crosswalks to correctly and quickly interpret pedestrian\nintentions, may improve the ﬂow of trafﬁc and support the situational awareness necessary for\ninterventional decision-making. The picture-in-picture live trafﬁc view implemented in the pro-\ntotype was intended to increase the situational awareness of the study participant. By following\ntrafﬁc while using a mobile phone, the participant should be able to recognize critical situations\nmore quickly and intervene accordingly. The system also sends a notiﬁcation with the option to\napprove or deny the intervention request. Rümelin [9] explained that because of easy Internet\naccess and available links to some car applications, most passengers would rather have a mobile\ncontroller than a built-in one. Although the use of a mobile device involves a higher cognitive\neffort, it seems that the ﬂexible functionalities are nevertheless more advantageous. In situations\nwhere a mobile phone cannot be easily connected to the car system, the occupants felt isolated.\nThis also contradicts the idea that vehicles should simply be regarded as another everyday place\nin which to provide support in terms of everyday activities. It is not primarily about the control of\nthe automated vehicle, but the travel experience. Often, a mobile device determines the route on\nthe way to the car. This trend suggests that researchers should also deal with the activities prior to\nthe trip, in terms of the navigation system and route planning [9].\n2.3\nPassenger’s Attitude (Willingness To Cooperate And Trust)\nThere are some key components that should be considered when developing interactive infotain-\nment systems, in order to understand and therefore improve trust in and acceptance of the au-\ntonomous system. One of the biggest problems, as previously stated, is intervention approaches\nfor AVs in urban environments [1, 14, 7, 15]. As soon as the passenger of an AV of a higher level\nis no longer obliged to pay attention to the primary task, the question arises as to what extent the\npassenger should be able to inﬂuence NCSS of the journey at his or her own personal will. Wang\n[13] identiﬁed ﬁve main criteria for NCSS (i.e. noncritical spontaneous AV-cooperation) for his\ndesign framework:\n1. Intention, (i.e. Human and system)\n2. Interaction, (i.e. Cooperation on levels of the AV described in 2.1)\n3. Environment, (i.e. Road conditions, street type and appropriate driving style)\n4. Traffic, (i.e. Current location, Marking the surrounding road users)\n5. Vehicle information, (i.e. Travel speed & acceleration, fuel/ battery status)\nTrip-related information is usually communicated to the driver in a cooperative way. Therefore,\nit is recommended to let the AV communicate using anthropomorphic characteristics (e.g. human\nfacial expressions, that clearly convey the importance of a message). Explicit, transparent commu-\nnication in a human-like way could help uncertain and inexperienced users to trust a novel system\n[7].\n2.3.1\nCustomized UX\nCustomization of user experience has become a fundamental need for users in everyday interac-\ntion with technology. In the context of automated driving, this means inﬂuencing driving behavior,\nspontaneously intervening in navigation, and the visual structure of presented information on the\nrespective UI. Terken concluded that an AV that is not able to take into account the user’s pref-\nerences will not be used. This also includes the frequency in which the vehicle wants to interact\nwith the passenger. It should be possible not to be disturbed by the autonomous vehicle (i.e.\nintervention requests) during NDRT [11].\n5"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 11, "text": "2.3\nPassenger’s Attitude (Willingness To Cooperate And Trust)\n2\nRELATED WORK\n2.3.2\nTrust And Usability\nFigure 2.2: Miglani’s hypothesis: Trust, situational awareness and cognitive workload [7]\nTrust and perceived safety, i.e. comfortably loose situational awareness for non-driving related\ntasks (NDRT) seem to have a close relationship with each other2.3.2. This is no longer about the\npure driving functionality of the autonomous system, but about spontaneous, intuitive and, above\nall, about temporally realisable intervention possibilities in current route processing. If the UI is\nnot adapted to the passenger in this aspect, some people may experience miscommunication, a\nperceived loss of control and in some cases forms of misuse or disuse of this new technology.\nNevertheless, such technology tempts the end user after a certain period of familiarization to trust\nthe previously functioning system too much (i.e. misuse). This is already a known problem in the\nlower automation functions (e.g. appropriate driving control, lane centering). The goal here is to\nsupport the passenger in his pursuits in a trustworthy way. For this, the system must be perceived\nas reliable, capable and predictable [5, 7].\nInternal Factors\nTrust in automated systems can thus be classiﬁed as the satisfaction of expec-\ntation the individual user’s experience under unpredictable and possibly dangerous conditions [5]\nIt has already been mentioned that trust and user experience are dependent on each other in certain\naspects. As everyone has individual preferences when it comes to technology use, there are many\ninternal factors that can inﬂuence subjective user trust. Thus, the trust of each individual depends\non personality traits (i.e., age, Big-5 personality, experience and skills, AV knowledge, context of\nuse, cultural background), current well-being (i.e. physical and mental health) and the perceived\nworkload for cooperation (e.g., complex handling of the interface, how information is designed,\ndisplayed and communicated) [5, 1, 9]. Another factor, which is composed of the preceding\nfactors, is the expectation of the system’s functionality and limitations [9]. Within this context,\na further distinction is made between \"fundamental trust\" before, \"situational trust\" during, and\n\"learned trust\" after system interaction[5].\nExternal Factors\nWhile internal human factors are person-dependent and can vary greatly, there\nare some external factors that have been shown to either strengthen trust or at least prevent mis-\ntrust. Having a professional-looking UX design does not seem to increase trust measurably, but it\nlowers potential distrust tendencies [5, 7]. To make self-driving cars suitable for society at large,\nthe system must convey professionalism, reliability and trustworthiness. By considering certain\nUX guidelines, internal trust factors can be inﬂuenced with the help of external design aspects. So-\ncial awareness and brand recognition, system performance and intention transparency, interaction\n6"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 12, "text": "2\nRELATED WORK\n2.3\nPassenger’s Attitude (Willingness To Cooperate And Trust)\nparadigm (audible, haptic, visual), and usability of the interface play a role in fostering internal,\nindividual trust toward the automated driving system[5, 1, 7].\n7"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 13, "text": "3\nCONCEPT AND IMPLEMENTATION\n3\nConcept And Implementation\nMost research studies examine basic functions of higher automation levels in controlled scenar-\nios (e.g., highway situations, parking space search or lane change).In urban situations, too little\nemphasis is placed on the user’s relationship of trust in the system UI. Efﬁcient, trustworthy co-\noperation between humans and the autonomous driving system should be based on the advantages\nof each party. When we look for recommendations for a restaurant or a snack bar on environment-\nbased navigation apps, the choice is sometimes overwhelming in urban environments, depending\non the neighbourhood. Also when looking at a rear seat passenger, a lower situational awareness\nis to be assumed due to the sight restriction of the seat and prior experience in rear seat travel.\nIntervention possibilities in the maneuvers (medium-term planning) or the trajectory (short-term\nplaning) of the AV, could be difﬁcult to evaluate in an staged online study. Those levels could\ncreate intense experiences under time pressure combined with real life testing scenarios. In the\ninterest of constructive usability of collected survey data in this user study, we decided to develop\na prototype with a focus on the navigation level (long-term planning) [13] with the aspect of time\npressure. In the future, for example, one will sit in the back seat of a moving, self-driving car. The\nquestion now arises as to how fast and spontaneous freedom to make decisions in inner-city route\nplanning can be implemented with such novel technology (e.g., built-in car infotainment systems,\nmobile phone navigation). In a conventional driver-passenger relationship, for example, it is pos-\nsible to inﬂuence the journey in a matter of seconds. This spontaneous form of route interruption\nis uncomplicated (i.e. verbal communication) and is based on the experience that the driver of\nthe vehicle understands the request and will be able to give a trustworthy, transparent indication\nof what he or she has decided to do as a consequence to that. If a computer system replaces the\ndriver, which should aim to offer similar interaction possibilities, there is no deﬁned universal\nbalance. How extensive the information presentation and transparency of maneuver planning such\nan interface should have to fulﬁll, the psychological needs of safety, autonomy and freedom are\nyet to be determined [13]. Involving the passenger in the driving process in terms of their wishes,\nplans, preferences and concerns is probably the most sensible way to promote pleasant travel ex-\nperiences with self-driving cars. In order to make AVs suitable for society at large, the way in\nwhich the system is handled and the way in which the human and the system cooperate is of great\nimportance. It has to be quick, trustworthy, customizable and transparent. For these reasons, we\nchose the mobile device as the interaction apparatus.\n3.1\nReroute Scenario\nWe set up a preexisting route 2 for the three different scenarios. The task is to plan an additional,\nintermediate stop to get the options \"ice cream\", \"a quick snack\", \"coffee\" in randomized order.\nThis stabilizes the quality of the measures taken, due to the equal split of \"ﬁrst time use\" and\n\"learning effect\" after repetition. The pre-selected route is preset for all levels (i.e. Level 1 - Ice\ncream shops, Level 2 - Quick Snack shops, Level 3 - Coffee shops).\nThe starting point of the route (see 3.1) was directly in front of the LMU building at \"Geschwister-\nScholl-Platz\" and the destination was \"Königsplatz 1, 80333 Munich\". The closest address that\ncould be set as the starting point with Google Maps was \"Ludwigsstraße 29, 80539 Munich\".\nDue to the high volume of surrounding businesses, that would be interpreted as possible NC-\nSSs, we chose this route as the starting point for the three detour scenarios. As the ﬁgure shows,\nthere are numerous restaurants and stores, which could be chosen for a stopover. The partici-\npants were asked to imagine themselves on the rear seat of an autonomous vehicle in the year of\n2030. The group FT had a trafﬁc cam continuously moving towards the crossing, i.e. moving car\nscenario. The group ST had a trafﬁc cam staying in place, i.e. parked car scenario.\n2https://www.google.de/maps/\n8"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 14, "text": "3\nCONCEPT AND IMPLEMENTATION\n3.2\nUI design\nFigure 3.1: Preset route for all levels\n3.2\nUI design\nFigma\nTo ﬁnd out more about the appropriate balance between information density under time\nconstraint, we implemented three complexity levels with the UX-Design tool \"Figma\"3. This de-\nsign program enables the creation of demonstrative UX prototypes. All implemented design ele-\nments can be assigned interaction functionalities. However, there are some limits to the program’s\nfunctionality. The magniﬁcation or dynamic store display used in today’s mobile navigation appli-\ncations cannot be implemented with this. Nevertheless, we thought it was a good idea to use Figma\nto create a reroute-intervention design, since prototype ﬂows can be created and tested directly on\nthe mobile device using an aid application called \"Figma Mirror\". This way the screen captured\ninteraction could be evaluated for data after the study participation. We created six big layout\nboxes in the Figma ﬁle to structure the workplace for the six variants (FT1, FT2, FT3;ST1, ST2,\nST3). The levels are named after the abbreviation of the group (i.e. FT or ST) and the number of\nthe tested information density level (i.e. simple, medium, complex). Since the reroute information\nin the full map screen is the same for FT and ST, we picked these screenshots for illustration.\nInformation density\nBased on Wang’s framework (2.1), we designed three levels of UI infor-\nmation density. These levels present different densities of information for the perception, compre-\nhension and trajectory levels of the automated driving system to test the adequate \"sweet spot\" for\ntrust (see 2.3.2). All created frames of the prototype were created considering the error tolerance.\nAt all points of the user journey is a back or deselect button to undo the last interaction or to move\nup one menu level (anchor = home screen).\nLevel 1 - simple\nmakes use of perception level information, i.e. marking of pedestrians(yellow)\nand cars(pink) in trafﬁc cam (AR style), current speed, parking symbol (grey in drive, red in\nparked), time of new route (route selection in map).\nLevel 2 - medium\ndisplays perception level information and comprehensional information, i.e.\nmarking of the selected route in the trafﬁc cam (AR style), additional symbol for speed indication,\ntime and distance of new route (route selection in map), distance traveled and left to destination,\n3https://www.ﬁgma.com/\n9"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 15, "text": "3.2\nUI design\n3\nCONCEPT AND IMPLEMENTATION\nbattery status and range till empty, weather, time till arrival/ time till start, time and distance in km\nof reroute options (route selection in map).\nLevel 3 - complex\ncontains perception, comprehension and maneuver level information, i.e.\narrow indication of maneuvers in the trafﬁc cam (AR style), weather and temperature, current\nmovement indication (submenu, left side and navigation screen), time and distance and added\ntime of reroute (route selection in map).\nHome screen\nBased on the home screens of our prototype for the FT group, the home screen\nfunctionalities for both groups can be explained. Every screen with a sub-menu (i.e. Home, trafﬁc\ncam, navigation screen) offered the interaction with the smiley (i.e. simple notiﬁcation about\nrerouting options, see level 3, left picture of 3.2). A picture-in-picture view, reachable from the\nhome screen (and level 3 map view) marked the nearest pedestrian (color = yellow) and nearest\nvehicle (color = pink) with colored boxes. The picture-in-picture view could be magniﬁed by\nclicking on the small video feed. The small picture-in-picture map opened the navigation screen\nwhen clicked (bigger picture-in-picture map and sub-menu).\nSub-menus ST\nThe sub-menus of FT (3.2) and ST (3.3) differ in the displayed time, current\nspeed, distance traveled and parking icon (i.e. moving car or parking car). For the picture-in-\npicture trafﬁc view of each level the same degrees of information difference can be seen in the\nenvironment markings. The progress bar visually indicates route progress and is also described in\nlevel 2 and 3 with \"6 mins left\" or \"starts in 15 mins\". The smiley in the middle of the screen has\nthe functionality to inform about possible reroutes. This was implemented in a anthropomorphic\nand transparent way, making use of the possible system trust establishment factors as described by\nby Miglani [7].\nPicture-in-picture elements\nLevels 1 and 2 offer the same scope of picture-in-picture function-\nality (3.2). The ﬁrst one is the previously mentioned trafﬁc cam (with magniﬁcation screen), the\nsecond one the movable map with the preset route. In the navigation screen of level 3 there is\nalso a small trafﬁc cam integrated to test users preferences of picture-in-picture functionalities. In\nlevel 1 pedestrians and vehicles are marked (perception), in level 2 the deﬁned route on the road is\nadditionally displayed (comprehension) and in level three a maneuver indication (e.g. blue arrow)\nhas been added (trajectory).\nRecommended shops\nFor this part we looked for possible shops near the route that provided a\ngood reroute option. To make the study a bit more dynamic and not offer the same stores in each\nlevel, I looked for comparable categories. Since the scenarios are supposed to be a spontaneous\neveryday stopover, I decided on the business categories \"ice cream parlor\",\"quick snack\" and\n\"coffee\" (see 3.1).\n10"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 16, "text": "3\nCONCEPT AND IMPLEMENTATION\n3.2\nUI design\nFigure 3.2: FT Home Screen Level Overview\n11"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 17, "text": "3.2\nUI design\n3\nCONCEPT AND IMPLEMENTATION\nFigure 3.3: ST Submenu Level Overview\n(a) Level 1 - simple information density\n(b) Level 2 - medium information density\n(c) Level 3 - complex information density (picture-in-picture trafﬁc view)\nFigure 3.4: Navigation screen with preset route of all three levels (FT and ST)\n12"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 18, "text": "3\nCONCEPT AND IMPLEMENTATION\n3.2\nUI design\nShop Choice - Level 1 - Simple Information Density\nIn the ﬁrst level, the occupant of the\nautonomous vehicle has instructions to pick up ice cream on his way to Königsplatz. We chose\nthe ice cream parlors \"Der Verrückte Hutmacher\" and \"Eiscafé Italia\" as possible shop choices.\n\"Der Verrückter Hutmacher\" lies closer to the starting point of the preset route, \"Eiscafé Italia\" is\nlocated further away.\nShop Choice - Level 2 - Medium Information Density\nIn the second level, the occupant of\nthe autonomous vehicle has to pick up a quick snack on his way to Königsplatz. We chose the\nrestaurants \"Wais Küche\" and \"Sam’s Falafel\" as possible shop choices.\n\"Wais Küche\" lies closer to the starting point of the preset route, \"Sam’s Falafel\" is located further\naway.\nShop Choice - Level 3 - Complex Information Density\nIn the third level, the occupant of the\nautonomous vehicle has to pick a coffee shop on his way to Königsplatz. We chose the restaurants\n\"Gartensalon\" and \"Café im Vorhoelzer Forum\" as possible shop choices.\n\"Gartensalon\" lies closer to the starting point of the preset route, \"Café im Vorhoelzer Forum\" is\nlocated further away.\nSystem Shop Recommendations\nIn order not to reduce the cognitive load of the theoretical\nbackseat passenger in combination with the aspect of time pressure, we decided to offer only two\nstores per task. This reduction of choice was staged in the study as an AV system recommendation\nof the current environment and aims toward more efﬁcient decision making in situations with time\nconstraints. Each shop had two different reroute options varying in their street and maneuver\nselection to avoid the trafﬁc disruption (marked in orange, 3.4).\nShop Menu:\nFor each of the six stores, I created a ﬁctitious menu of the most purchased prod-\nucts. The dish information is listed next to the information about the reroute alternatives, also\nunder the category Shop Information. This menu can be reviewed as a popup window using the\nmenu icon, when a shop is selected. This interaction is marked with the black arrows in 3.6.\nNavigation Screens\nThe difference of the displayed map in the navigation screens of level 1\nand 2 is the labeling of starting point and destination. In level 1 there is no indication, in level\n2 the starting point and destination are displayed at the top of the map and in level 3 there is a\n\"maneuver planer\", depicting all maneuvers until arrival at the destination address. For the ﬁrst\nand second levels this navigation area is not absolutely necessary, but it was added for the sake of\ncomparability with the third level.\nRecommended Routes\nAdding the addresses of the 6 shops in between start and destination\naddress of the \"Google Maps\" preset, resulted in 6 initial reroute suggestions. In separate tabs I\ncompared and created alternative routes by setting maneuver points that force the navigation tool\nto recalibrate the optimal suggested route. These slightly more drastic shop reroute options were\nalso offered as an alternative within the prototype interaction as shown in 3.6. The information\ncontent provided about the routes differs depending on the information density level (e.g. time of\nnew route, additional time it would take and new distance to ﬁnal destination).\n13"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 19, "text": "3.2\nUI design\n3\nCONCEPT AND IMPLEMENTATION\nFigure 3.5: Navigation Screens Level Overview\nFigure 3.6: Reroute Options Level Overview With Shop Menus\n14"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 20, "text": "3\nCONCEPT AND IMPLEMENTATION\n3.3\nImplementation\n3.3\nImplementation\nSuccessful Reroute Interaction Flow\nThe user starts in the home screen and sees the picture-\nin-picture trafﬁc cam, map and sub-menu (3.2). Clicking on the map in the home screen sends\nthe user to a navigation screen (3.5) with a bigger map view and the sub-menu of the tested level.\nClicking on the map again opens a full-screen map where the selection of recommended shops is\npossible. Once a suggested shop is selected in the full screen map, the interface offers two different\nroutes each to reroute to the selected store. The selection can be conﬁrmed by clicking the green\ncheck-button at the bottom of the screen. After conﬁrmation the other routes disappear and the\npicked route is set and by ﬁnally clicking the yellow button \"GO\" the study task of rerouting the\nAV is completed. With a notiﬁcation screen, the participant was informed about the success and\ninstructed to stop the screen recording.\nFigure 3.7: Task Completion Message After Reroute Conﬁrmation\nTrafﬁc Camera\nSince hand-held devices lower situational awareness and are likely chosen as\nthe main interface for future AV (sharing), we implemented a trafﬁc camera view (e.g. 4(c)) into\nthe hand-held reroute prototype. The videos displayed were those of an already slowly moving\ncar for FT (3 Minutes, moving car) and a parked camera view for ST (15 minutes, parked car).\nThe video footage used for this trafﬁc cam was recorded in front of the LMU building and edited\nin \"Adobe After Effects\"4 to display an AR-style trafﬁc cam view. Figma’s tools are not able\nto implement video footage formats, but are able to integrate moving picture formats like \".gif\".\nFurther I used the rendered video with simulated AR overlay and uploaded them to to a web tool\nnamed \"Giphy\"5, in order to create 20-30 second moving picture loops. Those were compatible for\ninsertion in \"Figma\" and were implemented in the correct interface level to test the effect on better\nsituational presentation and to test the picture-in-picture impact for navigation level, secondary\ntasks.\n3.4\nPilot Study\nTo test the viability of the individual prototype screens, my design ideas were commented. The\ngoal was to get subjective evaluation of my design for existing functionality and aesthetics, which\nwere developed with the previously mentioned trust factors in mind. In a ten-minute personal\ninterview, n=11 participants were presented with the concept of a home screen, navigation screen\nand a notiﬁcation screen. The rough ideas for the sub-menu and picture-in-picture functionalities\n(i.e., picture of a static trafﬁc cam and map) were then evaluated for positive and negative aspects.\n4https://www.adobe.com/de/products/aftereffects.html\n5https://giphy.com\n15"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 21, "text": "3.4\nPilot Study\n3\nCONCEPT AND IMPLEMENTATION\nTo document participants’ opinions, I included screenshots of the designs in an online survey\nform. A few demographic questions were asked ﬁrst, and then text boxes were provided under\neach screen design for comment, regarding the UI elements and overall impression of an AV\ndesign. Thus I was able to improve the pilot study design through iteration.\nSummary\nIn the Pilot Study the ﬁnal comments and advice for the prototype design were col-\nlected. As a result, I entirely deleted the notiﬁcation screen and integrated the restaurant informa-\ntion (i.e. address, menu with top dishes) that was previously on the notiﬁcation screen into the\nfull view of the map. I chose the street view as the map design (100% of the 11 participants said\nthey preferred the street view over a \"dark mode\" or \"satellite view\"). In addition, there was a high\ndemand to display the trafﬁc situation with the help of the picture-in-picture live camera view.\nTo comply with this request, I recorded videos and implemented them according to the paragraph\n\"Picture-in-Picture\" 3.2.\n16"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 22, "text": "4\nUSER STUDY\n4\nUser Study\nParticipants used a \"Figma Mirror\"6 prototype on their mobile device and a computer with Zoom in\nthis online study to test an inner-city rerouting planning design with staged scenarios and accom-\npanying task instructions. I created a simple test prototype ﬂow, including all relevant information\nregarding the mobile screen capture functionality for apple and android users.\nDue to the current pandemic, it was not possible to conduct the study on site. To adhere to the\nscope of a bachelor thesis study, we conducted a digital one-to-one online between group study\non Zoom7. To organize participants, we offered several one-hour appointments slots on Doodle.\nStudy execution took place over a two-week period beginning 23.08.2021 and continuing through\n04.09.2021 with 3-4 daily meetings. This study was completed on 04.09.2021 with the required\nnumber of n=30 participants.\nInterview Set-Up:\nAll participants signed the participation list and consented both verbally and\nby continuing beyond the second page of the participant questionnaire (i.e. study introduction and\nconsent form). At the arranged time, the participants were contacted via E-mail. The Zoom link,\nlogin-credentials for the required Google account and the list of participants (consent signature)\nwere sent in advance. Participants were asked to download the mobile applications Figma Mirror\nand Google Drive on their devices and join the Zoom meeting with a computer or laptop. Once the\nparticipant was introduced to the Zoom meeting and the details of the study, the set-up check took\nplace, i.e. Login, screen capture introduction and the study questionnaire. The participants were\nwalked through logging into Google Drive and Figma Mirror with the participant’s Google account\ninformation. After that the Zoom recording began and we proceeded with the study (survey,\ninteraction + survey, semi-structured interview).\nResearch Questions:\nIn order to test the possible inﬂuence of time pressure on the partici-\npant’s cooperative behaviour in rerouting scenarios, the 30 participants were divided into two\nequal groups (i.e. between-group-design). The ﬁrst group had 3 minutes (FT = Fast Thinking,\nParticipant ID 1-15) to plan a stopover, with the simulated camera feed of a AV that was already\nmoving. The second group (ST = Slow Thinking, Participant ID 16-30) had 15 minutes to add\nan additional stop with the camera feed of a non-moving parked car. Both groups were given\nthree identical sets of information density implemented in the design of both groups (moving vs.\nparking). These different density levels of information provision were tested in random order (i.e.\nFT1, FT2, FT3 | ST1, ST2, ST3), aiming to answer the following research questions:\nRQ1: How does the amount of information impact a passenger’s cooperative performance and\ntrust in the system? And is the time restraint relevant in this case?\nRQ2: How much information should be presented on a UI to ensure that the passenger is able to\nmake an intuitive, spontaneous decision?\nRQ3: How would the degree of information capacity affect cooperative performance, willingness,\nand trust in the system? And is the degree of time constraints relevant in this context?\n6https://www.ﬁgma.com/mirror\n7https://explore.zoom.us/de/products/meetings/\n17"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 23, "text": "4.1\nMeasurements\n4\nUSER STUDY\n4.1\nMeasurements\nAll main study measurements were collected using the participant’s Limesurvey 8 questionnaire\n(time according to reported feedback), two separate ﬁnal interview questionnaires separately cre-\nated and completed by me during the semi-structured interview regarding the subjective experience\n(ST vs. FT) and the uploaded screen captures (i.e. interaction steps, chosen location).\nThe participant’s questionnaire consisted of 3 parts.\nThe ﬁrst part consisted of demographic\nquestions (see results = 4.2). The second part introduced a static AV scenario in the middle of\nthe Ludwigstrasse near the subway station \"Universität\" (TO - baseline trust). Participants were\nasked to imagine themselves in the rear-sear of the automated vehicle. To get a reliable indicator\nof trust in the automated system in rerouting situations, a basis to compare to was determined\nwith an adjustment of the \"Situational Trust Scale\"[6]. All STS-questions contained a Likert-7\nscale from (1 - strongly disagree to 7- strongly agree). With the explained scenarios in mind and\ntheir pre-knowledge about higher automation, passengers develop a \"Baseline Trust\" toward AV\nrerouting situations (i.e. 3(a)) before beginning the prototype testing. All three prototype levels\nwere measured and evaluated for Trust (T1 - 3(b)), Usability (System Usabiliy Scale (SUS = 10\nLikert-5 scale questions from (1 - strongly disagree to 5- strongly agree))9) and three self-deﬁned\nquestions about experience. The ﬁnal section consisted of self-created questions about the feeling\nof control over the situation, the sufﬁciency of store information, and whether there was enough\ntime to make a conﬁdent reroute decision. Required performance measures, i.e. interaction steps,\ntime to ﬁnish task and chosen intermediate shop were evaluated using the uploaded mobile screen\ncaptures. The third part, I documented comments in the context of a semi-structured interview\nabout the participant’s trust, what contributed to it and what decreased it. Insights about the overall\nexperience and opinions regarding design and interaction were also collected. Furthermore, each\nparticipant was asked about his or her preferred end-user device in automated vehicles (mobile or\nbuilt-in). The results can be viewed in more detail in the Results section.\n4.2\nParticipants\nA total of n=30 participants took part in the main study of this thesis. Participants were grouped\naccording to age with by far the largest group of participants belonging to the 20-29 age group\n(n=25, 83.33%), followed by the 30-39 age group (n=3, 10%) and the 60-69 age group (n=2,\n6.67%). This resulted in an average age of 27.43 and a standard deviation of 10.68. 20 participants\nwere male(66.67%), 9 female(30%) and 1 participant(3.33%) declined to provide any information.\nThe following travel data refers to the time before the COVID-19 pandemic. 13 participants ( 43.33\n%) reported travelling weekly as a passenger in a car, 11 ( 36.67 %) reported monthly, 4 (13.33\n%) daily and 2 (6.67 %) rarely. Here, 11 (36,67%) participants reported an average trip duration\nof 1-2 hours, 8 (26,67 %) a duration of 30 minutes-1 hour, 7 (23,33 %) a duration of less than 30\nminutes and 4 (13,33 %) a duration of 3-5 hours per trip.\n4.3\nApparatus\nAll incorporated tools can be found in the footnotes. The online scheduling application Doodle10\nwas used to set up 1 hour meeting time slots. We set the estimated time to conduct the main part\nof the interview to 45 minutes per participant. The remaining 15 minutes functioned as a buffer\nfor organizational purposes(i.e. participation signature, \"Figma Mirror\" and Google Drive set-up).\n8Limesurvey: https://manual.limesurvey.org/?/\n9https://www.usability.gov/how-to-and-tools/methods/system-usability-scale.html\n10https://doodle.com/\n18"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 24, "text": "4\nUSER STUDY\n4.4\nStudy Interaction Procedure\nRemote Study Design\nIn the context of this online study, I set up a new Google account for the\nstudy participants. This allowed both me to upload screen recordings to Google Drive 11 and re-\nmotely control the presented interfaces on the participants mobile devices. The entire meeting was\nrecorded via Zoom for post analysis of the participants’ statements (with participant’s consent).\nWe decided to include \"Figma\"12 in the study design in combination with the interoperable mobile\nprototype test application \"Figma Mirror\". This setup allowed us to ﬁeld test a navigation level\nmobile UX design for AV intervention in the form of a remote online study. We prepared a on-\nline questionnaire to be completed (see measures (4.1)) by the participants after each of the three\nversions. After the study was concluded, the ratings of trust, usability and interaction experience\nwere inserted in a Google Form and evaluated according to the scale’s norms.\nFinal Interview Questionnaire\nThe ﬁnal interview questionnaire consisted of four questions\nregarding participant trust in the system. For each question it was possible to specify if the in-\nterviewee wanted to elaborate on their thought process. First, participants were asked to rank the\ndesigns they experienced. As we were interested in the effect of individual elements of the user\ninterface, we asked which areas of the design had a positive or negative impact on their trust in\nthe system. In the third question, we had participants vote on a scale of (not at all=1, 2, 3, 4, 5,\n6, 7=totally) whether they would use a hand-held passenger device for navigation purposes in the\nrear seat in fully automated vehicles. After this question, participants indicated if they preferred a\nmobile or built-in interface. Finally, the participant could express recommendations, preferences\nand ideas to make overall interaction with autonomous systems more trustworthy.\n4.4\nStudy Interaction Procedure\nIn three UIs with stated characteristics, participants had to make a rerouting decision for an AV\nwith the instructed scenario (Level 1,2,3) and given time window (FT or ST). After each level,\nthe participant stopped the screen recording and answered the questionnaire page for the version\naccording to 4.1. Participants were instructed to imagine themselves seated in the rear seat of\nthe AV, to test the suggested reroute prototype in the given scenario. After the participant logged\ntheir mobile device into \"Figma Mirror\" and \"Google Drive\", I asked them to try out their screen\nrecording before beginning with the main interaction. After receiving positive feedback from the\nparticipant, the participants were asked to open the questionnaire link in the Zoom meeting chat.\nThe participants had time to complete the demographic questions and the AV reroute scenario\nfor baseline trust (TO). Next, three identical questionnaire pages with three question groups (i.e.\nTrust, Usability, Experience) were presented for all three levels (ﬁrst the recorded interaction, then\nthe questionnaire). Both groups were informed as to the time remaining through a timer display\nshared by me via Zoom screen share. After the interactions, the questionnaire ended and the data\nwas submitted. The three recorded videos were uploaded to the assigned Google Drive folder.\nA concluding semi-structured interview was then conducted to inquire the overall experience and\ngain insight on the individual’s user experience with the prototype. I completed the questionnaire\nvia Zoom screen share in order to free up the participant for more constructive feedback. This\ninterview was also recorded for time-independent evaluation and to facilitate the ﬂow of the study\n(e.g. no long breaks due to comment typing). The comments were clustered at the end according to\nthe bottom-up principle and are presented in 5.5. Each Zoom session was recorded in two separate\nvideo ﬁles. The ﬁrst video documented everything up to the interaction with the last interface\nvariant and the second video captured the interview to make data evaluation (post interview) easier\nto structure. Every level, set up remotely via \"Figma Mirror\", was recorded with the mobile screen\ncapture functionality of the used device and later uploaded to the Google Drive folder matched to\nthe participant ID.\n11https://www.google.com/intl/de/drive/\n12https://www.ﬁgma.com/organization/\n19"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 25, "text": "5\nRESULTS\n5\nResults\n5.1\nPerformance\nInteraction steps\nCompared to FT, the ST had more time (15 minutes) to engage further in the\nUI resulting in more interaction steps (see 1(a)) and time till task completion (see 1(b)). The FT\ngroup ﬁnished the task of rerouting faster (FT123 Mean = 30.78, StdDev = 20.133; ST123 Mean\n= 50.56, StdDev: 81.457; [n=30] Mean = 40.67, StdDev = 59.830).\nAverage Time To Complete Task\nThe resulting time to ﬁnish the rerouting task reﬂects prior\ninteraction step data. The group FT tended to ﬁnish the tasks more quickly than ST (FT123 Mean\n= 00:51 ; ST123 Mean = 01:08; [n=30] Mean = 01:00.\nChosen Location\nOverall, most participants (n=21, 70%) opted for the detour to the level 3\nshop \"Café im Vorhoelzer Forum\". The location of this store is closest to the destination address\nand at the same time the route is mostly identical to the preset route to Königsplatz. In the ﬁrst\ngroup (FT), the majority of the n=15 participants chose the store furthest away (see 2(a))in the\nrespective level. In the second group (ST), the majority of the n=15 participants chose the closest\nstore (see 2(b)). Examination of the shop choice pie charts indicate that the Slow Thinking(ST)\ngroup more carefully considered different factors in choosing a shop while the Fast Thinking (FT)\ngroup more often chose a shop due to location. There may be other reasons why the second group\npredominantly chose the closer store, such as the factor time pressure, which has an effect on the\nperceived time one has left to make a rerouting decision. From the position of a moving car for the\nstore farther away, theoretically, one has more time before the planned route must be recalibrated\n(ﬁnal decision). For the closer store, the decision to reroute would have to be made earlier.\n(a) Average Interaction Steps\n(b) Average Time\nFigure 5.1: Average Interaction steps and time to reroute\n5.2\nTrust\nThe level of trust in AVs in navigation situations rose among all participants (compare T0 3(a)\nand T1 3(b)). The FT group (7 Likert-scale) had a lower initial trust level (FT-TO Mean = 4.37,\nStdDev: 0.965) for rerouting with the autonomous vehicle than the ST group (ST-T0 Mean = 4.88,\nStdDev: 0.724) (T0-[n=30] Mean = 4.63, StdDev:0.877). At the same time, after evaluating the\ninteraction data, FT participants showed an even bigger increase in trust score in the rerouting\ninteraction than ST. The level of trust in autonomous systems after the interaction is about even\nwith the median of FT-T1 (Mean = 5.83, StdDev = 0.748) and the ST-T1 (Mean= 5.8, StdDev =\n0.752) (T1 - [n=30] Mean = 5.82, StdDev = 0.746). In the information density comparison, level\n20"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 26, "text": "5\nRESULTS\n5.2\nTrust\n(a) Fast Thinking\n(b) Slow Thinking\nFigure 5.2: FT and ST - Shop choices *red = closer, *blue = further away\n1 achieved the highest trust score (1-T1 Mean = 5.99, StdDev = 0.619), followed by level 3 (3-T1\nMean = 5.76, StdDev = 0.909) and 2 (2-T1 Mean = 5.7, StdDev = 0.672).\n(a) T0 - Baseline Trust for Rerouting in AVs\n(b) T1 - Trust for Rerouting in AVs(average all 3 levels)\n(c) Level Overview (info density: 1=simple, 2=medium, 3=complex)\nFigure 5.3: Measures of Trust before and after the interaction with the mobile reroute prototype\n21"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 27, "text": "5.3\nUsability\n5\nRESULTS\n5.3\nUsability\nThe usability measures (result = 75.38 on a scale of 100, r=0.7538, StdDev = 15.619) indicated a\ngood to excellent usability (normalised rating > 68; adjectives \"good\" and \"excellent\" according\nto the proposal of interpretation by Bangor [2]) for this mobile AV rerouting prototype approach.\n(a) SUS - FT vs ST\n(b) SUS - Level Overview\nFigure 5.4: SUS - System Usabiliy Scale\n5.4\nExperience\nIn this section, we analyzed the variants of a hand-held prototype to evaluate the adequacy of the\nprovided information. The 3 self-deﬁned questions were measured with the Likert 7 scalar and\nmust be considered separately. The key aspects were the cooperative experience, i.e. the situational\nfeeling of control, users’ perception of shop information presented on the device, and the inﬂuence\nof time pressure on intuitive, ﬁrst-time user experience. Overall (n=30) mean for the Likert 7 scalar\nquestions control is mean = 5.93(agree), StdDev-C = 1.261, shop information is median = 4.42(\n4-5 = neutral - slightly agree), StdDev-SI= 1.761 , and enough time to reroute is median = 5.79(6\n= agree), StdDev-T =1.222. The following ﬁgures illustrate the scores the interface was able to\nachieve. The box-plot in 5(a) implicates agreement(6) and strong agreement(7) to the question of\nperceived control. In 5(b) the span is between slight disagreement (3) and agreement(6) regarding\nthe question if enough information is available about the shop. Finally, the perceived time to make\nan informed decision results in 5(c).\n22"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 28, "text": "5\nRESULTS\n5.4\nExperience\n(a) Control\n(b) Shop Info\n(c) Time\nFigure 5.5: Boxplots for perceived control, shop info and time\n23"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 29, "text": "5.5\nSemi-Structured Interview\n5\nRESULTS\n5.5\nSemi-Structured Interview\nAfter the study was completed, the comments were evaluated and the following topics emerged\nfrom the semi-structured interview. These were sorted and explored according to the bottom-up\nprinciple.\nVersion Ranking:\nIn the user ranking of interfaces, all of the participants had the opportunity to\nrank the versions to their UX. Level 3 was ranked highest (n=21 [70%]; FT=11, ST=10). Level 1\nreceived the next highest ranking (n=15 [50%]; FT=9, ST=6). Level 2 received the lowest ranking\nwith 14 participants ranking it in last place (n=14 [46.67%]; FT=9, ST=5)\nSuggestive Application For AV Rear Seat Passengers’ Ad-Hoc Route Control:\nOn a Likert-7\nscale it was evaluated whether passengers were likely to use a redirection function in the rear seat\nof a fully autonomous vehicle. The participants rated (likelyUse: Mean = 6.4, StdDev = 0.724).\nParticipants commented that the tool was useful under time pressure, but there is still room for\nimprovement.\nShop Symbols:\nIn all levels, the coffee mug symbol was displayed on the pin, which marked the\nshop’s location. The symbol should have corresponded to the product sold in the store marked on\nthe map. This was the case for level 3, but in levels 1 (Verrückter Hutmacher) and 2 the symbols\nshould have been representative of the shop (i.e. ice cream cone, knife and fork symbol).\nAV Control Interface:\nHand-Held Device vs. Built-In\nFrom all n=30 participants, n= 16 (53.33%) would like to interact with a built-in car interface and\nn= 14 (46.67%) would prefer to have a mobile interface as the main control instance of an AV.\nTrafﬁc Camera:\nThe trafﬁc camera view lead to n=4(13.33%) participants reporting a decrease\nin trust towards the autonomous driving system. These participants reported problems with the\nmoving image, causing them to feel compelled to act and thus making it more difﬁcult for them to\nreroute (cognitive distraction, stress). Similarly, n=18 (60%) participants reported that the trafﬁc\ncamera reinforced their conﬁdence in the system by providing situational awareness, awareness of\nthe environment, trafﬁc awareness, and transparency of system intent through the AR styled video\noverlay.\nTrusted Sound:\nTo decrease the overall cognitive workload of interacting AV passengers, par-\nticipants expressed the desire to have an audio setup, implying the importance of notiﬁcations\nduring AV rides. This would make better use of the user’s secondary attention and therefore re-\nlieve the perceived pressure to always be on the alert. n=9 (30%) thought sound cues could help\ngive subtle and non-intrusive notiﬁcations.\nVoice Assistance To Verbally Reroute:\nLikewise n=7 (23.33%) participants suggested a voice\nassistant function for better communication on the navigational level. Short commands like \"where\ncan I get a coffee now? \" or \"show me restaurants near route at time X\" were mentioned.\n24"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 30, "text": "6\nDISCUSSION\n6\nDiscussion\n6.1\nVarying UX Preferences For Car Infotainment Systems\nIn an effort to integrate the user into a highly automated system, systems must be highly adaptable\nto users’ preferences. There are several factors to consider when looking back to 2.3.2. Whether\nthe new technology is well received by the AV end user should consider individual preferences\nand habits.\nHuman Factor\nAge plays a decisive role here. Younger generations who learned to use mo-\nbile devices and computers at an early age can estimate the functional limits of a system more\nquickly. Therefore they know to what extent they should trust the understood system components,\na harder task for older demographic groups. This general prior knowledge regarding technol-\nogy and implicit boundaries of integrated functionalities could have led to a fundamentally better\nuser experience in the evaluation of our navigation prototype. The group of \"digital natives\" can\nquickly adapt to interactions they are unfamiliar with, whereas older generations may lose interest\nor patience and thus lower perceived control over the system in more complex, deeply-structured\napplications.\nAnthropomorphic Communication:\nIn situations with time pressure, it might be more con-\nvenient to only see the application’s basic functions. To successfully plan a reroute with this\nprototype, the map section with shop suggestions would sufﬁce. Some participants were therefore\nconfused by the centered smiley icon, which hinted at the possibility of rerouting, but did not in\nfact offer a actual reroute suggestion. Participants reported that a shortcut button to take the user to\nthe route planning screen would have been a nice addition to speed up effective task completion.\nPicture-In-Picture View Enhances And Decreases Trust:\nThe magniﬁed trafﬁc camera screen\n(accessed from the home screen) received widely differing assessments by the participants. It\nwas criticized that this should either be seen in full-screen landscape format or that the screen\ncould be removed from the interaction, due to its irrelevance to the actual task of rerouting. As\nalready presented in 5.5, an integrated camera view was mostly rated as a positive feature, but\nthere were also some disagreements that this trafﬁc view caused an unstable and stressful UX.\nDetecting and marking pedestrians, cyclists and other road users was rated as a fundamentally\nimportant function for establishing trust and raising awareness of such camera views in AVs in the\nparticipant interview. Marking the route on the road (e.g. lvl 2) in the style of augmented reality\nwas also mentioned positively, the additional arrow to indicate the maneuvers of the vehicle on the\nroad (e.g. lvl 3) was rated neutral or unnecessary.\n6.2\nCar Interface Information Density\nUser experience and the trust relationship regarding rerouting in AV could be examined in more\ndetail. Now we know how n=30 users with certain pre-existing knowledge (mostly the age group of\nuniversity students) rate this reroute interaction. Nevertheless, the similarity of the interfaces only\nallowed the levels of the design and overall interaction experience to be examined. The weather\nfunctionality is not considered necessary for reroute interaction. Despite this, future interfaces\nshould offer this function as an option, in order to perceive the system as an informed expert.\nUneven Information Spilt:\nThe information differences of the sub-menu for levels 2 and 3 are\ntoo subtle. In relation to the downgrade from level 2 to level 1, level 2 clearly receives more visible\ninformation. In addition to expected arrival time, distance and battery range, the weather could\n25"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 31, "text": "6.2\nCar Interface Information Density\n6\nDISCUSSION\nhave been taken out. This might have helped to distribute the users’ cognitive load more evenly\nbetween the levels for a clearer gradation of information density.\nLearning Effect\nDue to the previously mentioned similarity of the levels, the human learning\nfactor should not be disregarded. This effect sets in after the ﬁrst intuitive interface use. By\nrandomizing the versions presented in this study, we attempted to keep the impact of users’ learn-\ning effects on the resulting data as minimal as possible. In the concluding interviews, however,\nparticipants pointed to the learning effect they had observed for themselves.\n26"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 32, "text": "7\nLIMITATIONS AND FUTURE WORK\n7\nLimitations And Future Work\nConsidering the fact that the implemented interface is merely an interactive prototype without\nsound, makes the results of this study interesting for UX study, but hardly realistic. The ﬁgure\n5(b) regarding appropriate amount of information displayed about a shop revealed strong dis-\nparity. The shop information (mostly non-driving related) did not vary enough to give the user\nsufﬁcient information and thus deliver insight on the perceived trustworthiness of the limited shop\nsuggestions. Some participants seemed to like the simple solution of listing the top dishes, others\nwould have preferred a lot more information about the shops (i.e. free tables, opening hours, rat-\nings, full menu, preorder). We mainly focused on the design’s impact on user’s trust and system\nusability (based on 2.3.2.\n7.1\nLimitations\nDue to the COVID-19 pandemic and the expected effort in planning and implementing a face-\nto-face study in a simulator or car, we conducted this UX study using my online format study\ndesign. Participants were asked to imagine themselves in the situation of a rear seat passenger of\nan autonomous driving system, and were also allowed to use their personal mobile device for the\ninteraction. As such, the collected results should be considered with caution. The situation was\nrealistically represented by the camera perspective, but to enhance realness, future research should\nbe carried out with the help of a driving simulator or, at best, a study design with a real car.\n7.2\nShop Suggestion Process Under Time Pressure\nIndeed, perceived time pressure results in stress, which can cause indecisive behavior as well as\ndiscomfort. In a navigation map that offers more than two stores at the same time, the icons\nshould match the products offered by the store. Thus, several stores selling different products can\nbe represented in map view without the user losing orientation under time pressure. This is also\ncrucial for personalizing the pre-ﬁltered store recommendations. Using this symbol language, not\nonly the predominantly sold product could be recognized on the spot, but also dietary habits (i.e.\nvegetarian, vegan, allergy-related information, etc.) could be speciﬁed before the start of the ride\nin order to present an interesting and appropriate pre-selection of stores to the vehicle occupant.\nIn addition, suggestions were made to introduce ratings for the stores in order to better assess the\nstores in terms of quality and to indicate whether short-term table reservations are possible. Other\nsuggestions included an online ordering feature with a pick-up option as this would be useful\nespecially with regards to time management in AVs driving in inner-city trafﬁc.\n7.3\nCustomization\nDue to internal human factors that inﬂuence user’s trust relationship with a system, it is almost\nimpossible to include all preferences for all people into a universal interface design. Therefore,\ndeveloping concepts that can dynamically adapt the UX is recommended. It should, however, be\nconsidered that there are basic AV functions that should always be displayed, but some non-critical\nadditional information (i.e. camera views, maneuver execution) must also be able to be switched\non and off in the pursuit of a customizable, more personalized UX. This would enable functions\nsuch as the picture-in-picture trafﬁc view on the user interface to be switched on and off as desired.\n7.4\nVoice Assistant For Rerouting\nIn order not to put any constraints on the vehicle occupant’s primary attention, communication\nvia a voice assistant could be useful. A voice assistant could provide information on whether a\n27"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 33, "text": "7.5\nAudio Feedback And Notiﬁcation\n7\nLIMITATIONS AND FUTURE WORK\ndetour initiated by the user has been successfully planned or communicate information regarding\nthe probability of travel disruptions and trafﬁc ﬂow on the current route.\n7.5\nAudio Feedback And Notiﬁcation\nAn additional goal could be to lessen the overall cognitive workload (i.e. free up the primary\nfocused attention) of the AV interaction by making better use of the users’ secondary attention.\nInformation conveying auditive cues could help lower the cognitive workload and would make\nthe importance of a notiﬁcation distinguishable within seconds. Ultimately it would increase the\nfeeling of situational safety and trustworthiness of the system.\n28"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 34, "text": "8\nCONCLUSION\n8\nConclusion\nIn this bachelor thesis, we investigated the correlation of UX-information provision and trust\nin a rerouting prototype of an AV, and the role time pressure plays with regards to cooperative\nperformance and usability. By having the system offer a ﬁltered shop selection of nearby shops,\nthe groups were able to make fast and intuitive decisions to reroute mid-ride. This fostered higher\ntrust among the FT participants than among the ST group, compared with the baseline trust of\nAV rerouting. Getting an idea as to how day-to-day phone-based interaction with an AV could\ntake place has made some participants feel more conﬁdent to try out AVs, as soon as they become\navailable to the wider public. 16 (55,3%) participants indicated that a built-in car interface was\nthe preferred interface for automated driving and 14 (45,7%) stated a mobile device preference\nfor interaction. There were still some concerns about IT security and everyday complications\nwith mobile phones (i.e. low battery, no internet, slow-response times, device receives a call),\nbut the built-in car interfaces are viewed similarly (i.e. slow interface, outdated map database,\nheavy car components (e.g. multiple large built-in interfaces) that may lead to more battery/fuel\nconsumption).\nA Bigger Picture\nFuture research and pilot driving tests will show whether brought-in devices\nreliably function as the main interactive component. Offering a UI that is capable of hand-held\ndevice integration seems like a day-to-day concept users would accept. Keeping a core (\"backup\",\nmain controls to use the AV) built-in car interface, in case there are any technical complications\nwith the mobile device (connection issues, low battery, lost phone) is most likely the better so-\nlution. Evaluation of trust in the system revealed that the interface should be more ﬂexible in its\nappearance and functionality according to the current situation. Layout customization, according\nto ad-hoc personal requirements will become an important topic for future AV UX developers.\nIn order to feel safe and in control, the user’s individual need for information has to be satisﬁed.\nAdjustable presentation of car features (i.e. trust through display of expected information and in-\ntervention possibilities) could be the basis for the best possible personalized UX in AV. In some\nspontaneous, non-critical situations, a passenger might have sufﬁcient time to plan a diversion\nfrom the original route with lots of information about the environment and the car status. A frac-\ntion of both groups would like to have more shop information to be able to make a considerate\nreroute decision. The introduction of time pressure has shown that a reduced provision of informa-\ntion and a reduced number of available stores leads to a pleasant UX. This phone-based navigation\nintervention approach provides some preliminary insights for everyday use, but there is still a lot of\nresearch to be done (improvement of cooperative performance and trust through implementation\nof auditive and haptic cues) before the interaction becomes acceptable in a real-world setting.\n29"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 35, "text": "Content of attached .zip\n• Separate notes and reports documenting the progress of the thesis concept creation (ﬁnd\ntopic, pilot study, main study, prototype creation, study setup)\n• Pilot Study Results\n• The text in the entries may be of any length.\n• Edited video ﬁles of the AR-styled trafﬁc camera\n• Prototype File (Figma local ﬁle export)\n• Main Study Design & Study Questionnaires\n• Results (Google Sheets) with diagrams and mobile screen captures\n• Limesurvey raw backup of collected data\n• Figures used for this paper (UI elements, Designs, scientiﬁc frameworks and concepts)\n• Documentations of the individual performance (times to complete task) and ﬁnal interview\nnotes\nAcknowlegment\nI would like to thank Jingyi Li and Prof. Dr. Andreas Butz for the opportu-\nnity to write this bachelor thesis at LMU Munich Medieninformatik department considering the\nCOVID-19 restrictions. Special thanks to Jingyi Li for her professional advice and guidance dur-\ning the creation of this thesis. Finally, I thank all the people who supported me during my thesis\nstudies.\n30"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 36, "text": "References\n[1] Jackie Ayoub, Feng Zhou, Shan Bao, and X. Jessie Yang. From manual driving to automated\ndriving: A review of 10 years of autoui. In Proceedings of the 11th International Conference\non Automotive User Interfaces and Interactive Vehicular Applications, AutomotiveUI ’19,\npages 70–90, New York, NY, USA, 2019. Association for Computing Machinery.\n[2] Aaron Bangor, Philip Kortum, and James Miller. Determining what individual sus scores\nmean: Adding an adjective rating scale. J. Usability Studies, 4(3):114–123, 2009.\n[3] Melanie Berger, Aditya Dandekar, Regina Bernhaupt, and Bastian Pﬂeging. An ar-enabled\ninteractive car door to extend in-car infotainment systems for rear seat passengers. In Ex-\ntended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, CHI\nEA ’21, New York, NY, USA, 2021. Association for Computing Machinery.\n[4] Amber Case. Calm technology: Principles and patterns for non-intrusive design. O’Reilly\nMedia, Sebastopol, CA, ﬁrst edition edition, 2015.\n[5] Anna-Katharina Frison, Philipp Wintersberger, Andreas Riener, Clemens Schartmüller,\nLinda Ng Boyle, Erika Miller, and Klemens Weigl. In ux we trust: Investigation of aes-\nthetics and usability of driver-vehicle interfaces and their impact on the perception of auto-\nmated driving. In Proceedings of the 2019 CHI Conference on Human Factors in Computing\nSystems, CHI ’19, pages 1–13, New York, NY, USA, 2019. Association for Computing Ma-\nchinery.\n[6] Brittany E. Holthausen, Philipp Wintersberger, Bruce N. Walker, and Andreas Riener. Sit-\nuational trust scale for automated driving (sts-ad): Development and initial validation. In\n12th International Conference on Automotive User Interfaces and Interactive Vehicular Ap-\nplications, AutomotiveUI ’20, pages 40–47, New York, NY, USA, 2020. Association for\nComputing Machinery.\n[7] Abhijai Miglani, Cyriel Diels, and Jacques Terken. Compatibility between trust and non-\ndriving related tasks in ui design for highly and fully automated driving. In Adjunct Proceed-\nings of the 8th International Conference on Automotive User Interfaces and Interactive Ve-\nhicular Applications, AutomotiveUI ’16 Adjunct, pages 75–80, New York, NY, USA, 2016.\nAssociation for Computing Machinery.\n[8] Bastian Pﬂeging, Maurice Rang, and Nora Broy. Investigating user needs for non-driving-\nrelated activities during automated driving. In Proceedings of the 15th International Confer-\nence on Mobile and Ubiquitous Multimedia, MUM ’16, pages 91–99, New York, NY, USA,\n2016. Association for Computing Machinery.\n[9] Sonja Rümelin. The cockpit for the 21st century.\n[10] Sonja Rümelin, P. Siegl, and A. Butz. Could you please ... ? investigating cooperation in\nthe car. In Adjunct Proceedings of the 5th International Conference on Automotive User\nInterfaces and Interactive Vehicular Applications (AutomotiveUI ’13), pages 61–64. Auto-\nmotiveUI ’13, 2013.\n[11] Jacques Terken and Bastian Pﬂeging. Toward shared control between automated vehicles\nand users. Automotive Innovation, 3(1):53–61, 2020.\n[12] Marcel Walch, Stacey Li, Ilan Mandel, David Goedicke, Natalie Friedman, and Wendy Ju.\nCrosswalk cooperation: A phone-integrated driver-vehicle cooperation approach to predict\nthe crossing intentions of pedestrians in automated driving. In 12th International Conference\n31"}
{"doc_id": "PassengerReroute_Thesis.pdf", "page": 37, "text": "on Automotive User Interfaces and Interactive Vehicular Applications, AutomotiveUI ’20,\npages 74–77, New York, NY, USA, 2020. Association for Computing Machinery.\n[13] Chao Wang. A framework of the non-critical spontaneous intervention in highly automated\ndriving scenarios. In Proceedings of the 11th International Conference on Automotive User\nInterfaces and Interactive Vehicular Applications: Adjunct Proceedings, AutomotiveUI ’19,\npages 421–426, New York, NY, USA, 2019. Association for Computing Machinery.\n[14] Chao Wang, Matti Krüger, and Christiane B. Wiebel-Herboth. “watch out!”: Prediction-\nlevel intervention for automated driving. In 12th International Conference on Automotive\nUser Interfaces and Interactive Vehicular Applications, AutomotiveUI ’20, pages 169–180,\nNew York, NY, USA, 2020. Association for Computing Machinery.\n[15] Philipp Wintersberger, Hannah Nicklas, Thomas Martlbauer, Stephan Hammer, and Andreas\nRiener. Explainable automation: Personalized and adaptive uis to foster trust and under-\nstanding of driving automation systems. In 12th International Conference on Automotive\nUser Interfaces and Interactive Vehicular Applications, AutomotiveUI ’20, pages 252–261,\nNew York, NY, USA, 2020. Association for Computing Machinery.\n32"}
